InformationRegisters/СогласователиПротоколов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>СогласователиПротоколов</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Dimension>
				<Properties>
					<Name>ТипЦен</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыЦен</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Согласователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/СогласователиПротоколов/Ext/ManagerModule.bsl
Функция МожетСогласовывать(ТипЦен, Пользователь) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СогласователиПротоколов.Согласователь КАК Согласователь
		|ИЗ
		|	РегистрСведений.СогласователиПротоколов КАК СогласователиПротоколов
		|ГДЕ
		|	СогласователиПротоколов.ТипЦен = &ТипЦен
		|	И СогласователиПротоколов.Согласователь = &Согласователь";
	
	Запрос.УстановитьПараметр("Согласователь", Пользователь);
	Запрос.УстановитьПараметр("ТипЦен", ТипЦен);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если РезультатЗапроса.Пустой() Тогда 
		Возврат Ложь;
	Иначе
		Возврат Истина;
	КонецЕсли;

КонецФункции
